Первое задание: 
// Напишите программу, которая на вход принимает число и выдает его квадрат 
// (число умноженное на само себя)

// Например:
// 4 -> 16
// -3 -> 9
// -7 -> 49

// 1. Надо попросить ввести число
// 2. Записать число в переменную
// 3. Умножить число на тоже число и записать новую переменную
// 4. Вывести результат


Console.Write("Введите число: ");
int number =int.Parse(Console.ReadLine());
int sqr = number * number;
Console.Write($"Квадрат числа {number} равен " + sqr);

// $ - значит в скобках есть переменная, которую мы обозначили {}, + значит добавляем к строке следующий элемент
// Результат в терминале
// Введите число: 5
// Квадрат числа 5 равен 25
Тест